[Reference](https://levelup.gitconnected.com/understanding-groupby-function-in-pandas-dataframe-part-1-23cc762b3174)

In [1]:
import pandas as pd
scores = {'Zone': ['North','South','South',
                   'East','East','West','West','West'], 
          'School': ['Rushmore','Bayside','Rydell',
                     'Shermer','Shermer','Ridgemont','Hogwarts','Hogwarts'],             
          'Name': ['Jonny','Joe','Jakob', 
                   'Jimmy','Erik','Lam','Yip','Chen'], 
          'Math': [78,76,56,67,89,100,55,76],
          'Science': [70,68,90,45,66,89,32,98]}
df = pd.DataFrame(scores, columns = 
                  ['Zone', 'School', 'Name', 
                   'Science', 'Math'])
df

    Zone     School   Name  Science  Math
0  North   Rushmore  Jonny       70    78
1  South    Bayside    Joe       68    76
2  South     Rydell  Jakob       90    56
3   East    Shermer  Jimmy       45    67
4   East    Shermer   Erik       66    89
5   West  Ridgemont    Lam       89   100
6   West   Hogwarts    Yip       32    55
7   West   Hogwarts   Chen       98    76

In [2]:
gp = df.groupby('Zone')      # pass in a string to groupby()
for zone, group in gp:
    print(zone)
    print(group)             # group is a dataframe

East
   Zone   School   Name  Science  Math
3  East  Shermer  Jimmy       45    67
4  East  Shermer   Erik       66    89
North
    Zone    School   Name  Science  Math
0  North  Rushmore  Jonny       70    78
South
    Zone   School   Name  Science  Math
1  South  Bayside    Joe       68    76
2  South   Rydell  Jakob       90    56
West
   Zone     School  Name  Science  Math
5  West  Ridgemont   Lam       89   100
6  West   Hogwarts   Yip       32    55
7  West   Hogwarts  Chen       98    76

In [3]:
p = df.groupby('Zone')
for zone, group in gp:
    print(zone)
    print(group[['Name','Science','Math']])

East
    Name  Science  Math
3  Jimmy       45    67
4   Erik       66    89
North
    Name  Science  Math
0  Jonny       70    78
South
    Name  Science  Math
1    Joe       68    76
2  Jakob       90    56
West
   Name  Science  Math
5   Lam       89   100
6   Yip       32    55
7  Chen       98    76

In [4]:
gp = df.groupby(['Zone','School'])        # pass a list to groupby()
for zone_school, group in gp:
    print(zone_school)
    print(group[['Name','Science','Math']])

('East', 'Shermer')
    Name  Science  Math
3  Jimmy       45    67
4   Erik       66    89
('North', 'Rushmore')
    Name  Science  Math
0  Jonny       70    78
('South', 'Bayside')
  Name  Science  Math
1  Joe       68    76
('South', 'Rydell')
    Name  Science  Math
2  Jakob       90    56
('West', 'Hogwarts')
   Name  Science  Math
6   Yip       32    55
7  Chen       98    76
('West', 'Ridgemont')
  Name  Science  Math
5  Lam       89   100

In [5]:
gp = df[['Name','Math','School']].groupby(df['Zone']) # pass in a 
                                                      # Series to 
                                                      # groupby() 
                                                      # function
for zone, group in gp:
    print(zone)
    print(group)

East
    Name  Math   School
3  Jimmy    67  Shermer
4   Erik    89  Shermer
North
    Name  Math    School
0  Jonny    78  Rushmore
South
    Name  Math   School
1    Joe    76  Bayside
2  Jakob    56   Rydell
West
   Name  Math     School
5   Lam   100  Ridgemont
6   Yip    55   Hogwarts
7  Chen    76   Hogwarts

In [6]:
gp = df[['Name','Math','School']].groupby('Zone') # KeyError: 'Zone'

KeyError: ignored

In [7]:
gp = df[['Name','Math','School']].groupby(df['Zone'])

In [8]:
gp = df['Name'].groupby(df['Zone'])

In [9]:
gp = df[['Name','Math','School']].groupby(df['Zone'], sort=False)
for zone, group in gp:
    print(zone)
    print(group)

North
    Name  Math    School
0  Jonny    78  Rushmore
South
    Name  Math   School
1    Joe    76  Bayside
2  Jakob    56   Rydell
East
    Name  Math   School
3  Jimmy    67  Shermer
4   Erik    89  Shermer
West
   Name  Math     School
5   Lam   100  Ridgemont
6   Yip    55   Hogwarts
7  Chen    76   Hogwarts

In [10]:
df.groupby(['Zone','School']).mean()

                 Science   Math
Zone  School
East  Shermer       55.5   78.0
North Rushmore      70.0   78.0
South Bayside       68.0   76.0
      Rydell        90.0   56.0
West  Hogwarts      65.0   65.5
      Ridgemont     89.0  100.0

In [11]:
df.groupby(['Zone','School']).agg({'Science':'mean'})

                 Science
Zone  School
East  Shermer       55.5
North Rushmore      70.0
South Bayside       68.0
      Rydell        90.0
West  Hogwarts      65.0
      Ridgemont     89.0

In [12]:
df.groupby(['Zone','School']).agg({'Science':['mean','min','max']})

                Science
                   mean min max
Zone  School
East  Shermer      55.5  45  66
North Rushmore     70.0  70  70
South Bayside      68.0  68  68
      Rydell       90.0  90  90
West  Hogwarts     65.0  32  98
      Ridgemont    89.0  89  89

In [13]:
df.groupby(['Zone','School']).agg({'Science':['mean','min','max'],
                                   'Math'   :['mean','min','max']})

                Science           Math
                   mean min max   mean  min  max
Zone  School
East  Shermer      55.5  45  66   78.0   67   89
North Rushmore     70.0  70  70   78.0   78   78
South Bayside      68.0  68  68   76.0   76   76
      Rydell       90.0  90  90   56.0   56   56
West  Hogwarts     65.0  32  98   65.5   55   76
      Ridgemont    89.0  89  89  100.0  100  100

In [14]:
def grade(score):
    if (score >= 50).all():
        return 'All Pass'
    else:
        return 'Some Failure'

In [15]:
df.groupby(['Zone','School']).agg({'Science':['mean','min','max',grade]})

                Science
                   mean min max         grade
Zone  School
East  Shermer      55.5  45  66  Some Failure
North Rushmore     70.0  70  70      All Pass
South Bayside      68.0  68  68      All Pass
      Rydell       90.0  90  90      All Pass
West  Hogwarts     65.0  32  98  Some Failure
      Ridgemont    89.0  89  89      All Pass